{
  "backend/main.mo": "Motoko backend actor managing user profiles and scam reports with permission checks using AccessControl.",
  "feature_evidence.json": "Machine-generated feature evidence describing supported features, linked files, components, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind base styling and custom CSS variables defining a warm OKLCH color theme for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React app through main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theming and notification providers.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal prompting first‑time users to enter a name and save their profile via mutation hook.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper containing TopNav, routed page content, and a simple footer.",
  "frontend/src/components/navigation/TopNav.tsx": "Navigation bar with route links, authentication controls, profile display, and responsive mobile menu.",
  "frontend/src/components/resources/ResourcesSection.tsx": "UI card with accordion sections detailing evidence to collect and safe ways to contact banks.",
  "frontend/src/components/scam-reports/ScamReportForm.tsx": "Form for submitting scam reports with fields for type, title, description, and optional loss amount.",
  "frontend/src/components/scam-reports/ScamReportList.tsx": "Displays scam reports with filtering, loading states, error handling, and formatted report details.",
  "frontend/src/components/scam-reports/ScamTypeFilter.tsx": "Tabs-based filter component allowing users to select a scam type or view all reports.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and manages the backend actor based on user identity and refreshes related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useScamReports.ts": "React Query hooks for fetching all scam reports, filtering by type, and creating new reports via the backend.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and save the caller's user profile through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive light/dark theme CSS variables and base global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AuthPage.tsx": "Implements the authentication page with login/logout logic and optional profile setup prompt.",
  "frontend/src/pages/HelpHowToHelpPage.tsx": "Provides a multi‑step guide and resources for victims on what to do after being scammed.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, safety education messaging, and feature sections.",
  "frontend/src/pages/ScamGuidancePage.tsx": "Displays detailed explanations of various scam types with prevention tips.",
  "frontend/src/pages/ScamReportsPage.tsx": "Shows the community scam reports list, filtering options, and a submission form gated by authentication.",
  "frontend/src/utils/format.ts": "Contains formatting utilities for timestamps and monetary loss values.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugins for styling the frontend.",
  "project_state.json": "Contains the project’s current state, feature list, requirements, architecture notes, and image specifications."
}