{
  "backend/main.mo": "Motoko canister implementing user profiles and scam report creation with access control and query functions for retrieving reports and profiles.",
  "feature_evidence.json": "Metadata describing a feature request to add the 1930 cybercrime helpline to help content, including affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files, describing their roles in routing, UI layout, scam reporting, resources, and utilities.",
  "frontend/index.css": "Global Tailwind-based CSS defining OKLCH color variables for light and dark themes and applying base styles.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx and provides the root mount container.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all main routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting first‑time users to enter a name and save their profile using mutation hooks.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper providing top navigation, routed content, and a footer with attribution and disclaimer.",
  "frontend/src/components/navigation/TopNav.tsx": "Responsive top navigation bar handling route links, Internet Identity login/logout, profile display, and mobile menu.",
  "frontend/src/components/resources/ResourcesSection.tsx": "Accordion-based resources card describing evidence collection, safe bank contact steps, and highlighted 1930 reporting info.",
  "frontend/src/components/scam-reports/ScamReportForm.tsx": "Form component allowing users to submit scam reports with type, title, description, and optional loss amount.",
  "frontend/src/components/scam-reports/ScamReportList.tsx": "Displays scam reports filtered by type with loading, error, and empty states.",
  "frontend/src/components/scam-reports/ScamTypeFilter.tsx": "Provides tab-based UI for selecting scam type filters.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, updating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing identity state and providing login/logout handling.",
  "frontend/src/hooks/useScamReports.ts": "Hooks to fetch all reports, fetch reports by type, and create new scam reports via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks to fetch and update the caller’s user profile using the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining color palettes, themes, and base typography.",
  "frontend/src/main.tsx": "Initializes the React app with InternetIdentityProvider and React Query client.",
  "frontend/src/pages/AuthPage.tsx": "Authentication page using Internet Identity that handles login/logout, displays user info, and shows profile setup when needed.",
  "frontend/src/pages/HelpHowToHelpPage.tsx": "Guidance page outlining immediate steps to take after being scammed, with structured cards and checklists.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring hero content, safety education messaging, and links to guidance and scam reports.",
  "frontend/src/pages/ScamGuidancePage.tsx": "Detailed scam education page defining multiple scam types with descriptions, details, and prevention steps.",
  "frontend/src/pages/ScamReportsPage.tsx": "Community scam reports page enabling report submission, filtering, and browsing, with authentication checks.",
  "frontend/src/utils/format.ts": "Utility functions for formatting timestamps into human-readable dates and loss amounts into USD strings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and remove parameters from the URL hash.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project's current state, features, architecture notes, and metadata for the cyber‑guidance website."
}